<!-- dflook/terraform-github-actions {"workspace":"versions","backend":"67bbfa5bca1f2310a50ed6bc27b6665d6389e84628cf123072858695bdf4342a","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __versions__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "VF2nGJEd8s" -> (known after apply)
  ~ foreach = "TKuepJfB1r" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #213](https://github.com/dflook/terraform-github-actions/actions/runs/2297557597)